read_verilog src/*.v src/top_test/*.v pll.v

#loads ALL ECP5 primitive definitions (blackboxes + sim models)
read_verilog -lib +/ecp5/*

hierarchy -check -top top

#proc; opt; fsm; opt; memory; opt
#show -format png sdram
#techmap; opt

#ECP5-specific
synth_ecp5

stat
write_json synth_top.json
